---
layout: post
title: "Perfil de Super Matar"
---
<p class="copete"><img src="http://lh4.googleusercontent.com/-4tt5qlItEhQ/UFi5wfvumPI/AAAAAAAAA04/UbJadBcuoJE/s800/sergio01.png" width="108" height="206" alt="Super Matar Bros. 1" class="post-img icon">
Podr&iacute;amos decir que Sergio, tambi&eacute;n conocido como <strong>Matar</strong> o <strong>Super Matar</strong>, es la piedra base de este sitio web. Su importancia viene dada porque en sus inicios, este sitio solamente iba a ser un repositorio de los <a href="/juegos">juegos de NUP</a>, en los cuales la estrella indiscutida es este peque&ntilde;o amigo.</p>

<!--more-->

<p class="first"><span class="cap">P</span>ero, &iquest;qu&eacute; sabemos de este personaje? Para empezar, asisti&oacute; a la misma escuela que <a href="/personajes/2016/04/26/chapu.html">Chapu</a> y sus amigos, y no tard&oacute; en tener un protag&oacute;nico en la <a href="/relatos/chapu">Chapuman's story</a> a partir de <a href="/relatos/chapu/chapu03.html">Chapuman III: The last crusade</a>. De hecho, conoc&iacute; a Matar un a&ntilde;o antes que a Chapu (&iexcl;&iquest;por qu&eacute; a m&iacute;?!).</p>
<p><img src="http://lh4.googleusercontent.com/-YVgBvBZlZh0/UFi5wgx9m4I/AAAAAAAAA1E/xpjcGnXZ5cA/s800/sergio02.png" width="151" height="348" alt="Super Matar Bros. 2" class="icon toleft"> Su estatura compite en escasez con su cociente intelectual, siempre est&aacute; sonriendo, y cuando no lo est&aacute; es porque se est&aacute; riendo de manera hist&eacute;rica. Su frase m&aacute;s c&eacute;lebre: <em>&quot;falt&oacute; el Chapu&quot;</em>. Su t&eacute;cnica de combate: parar los golpes con la cara, al tiempo que amortigua el movimiento de su cabeza con el pu&ntilde;o &#8212;pr&aacute;cticamente se golpea &eacute;l solo.</p>
<p>&iquest;Por qu&eacute; realizar un videojuego en base a este personaje y no otro? En aquel entonces yo ten&iacute;a una respetable colecci&oacute;n de m&oacute;dulos musicales en formato Amiga (archivos MOD). En cierta ocasi&oacute;n, mientras los escuch&aacute;bamos con Walter nos topamos con uno en particular cuya melod&iacute;a nos hac&iacute;a pensar inequ&iacute;vocamente en este individuo. Luego de mucho divagar, llegamos a la conclusi&oacute;n de que ser&iacute;a la m&uacute;sica ideal para un videojuego que tuviera a Matar como protagonista, y de ah&iacute; a caricaturizar al personaje como Super Mario hubo un solo paso. Cerca de un a&ntilde;o despu&eacute;s ve&iacute;a la luz el <a href="/juegos/sm1.html">Super Matar bros 1: En busca de las fotocopias perdidas</a>, cuyo plot argumental estaba basado en hechos ver&iacute;dicos ocurridos un par de a&ntilde;os antes. A partir del <a href="/juegos/sm2.html">segundo juego de Super Matar</a> aparecer&iacute;a su hermano <a href="/personajes/2016/04/26/andres.html">Andr&eacute;s</a>, ya que no hay <em>Mario</em> sin <em>Luigi</em>.</p>

<p class="centro"><img class="foto" src="http://lh5.googleusercontent.com/-4Bh0JT-v7RQ/UFi5wvGOrkI/AAAAAAAAA1A/zQk7E9OrhD4/s800/sergio03.png" width="201" height="273"><br>
Super Matar: The next generation</p>

<p>Actualmente (a&ntilde;o 2003) Matar se dedica a realizar trabajos de alba&ntilde;iler&iacute;a, mec&aacute;nica automotriz y reparaci&oacute;n y armado de PCs, al tiempo que intenta llevar adelante su carrera universitaria y choca su auto contra volquetes mal estacionados (seg&uacute;n &eacute;l).</p>

<div style="background: url(http://lh5.googleusercontent.com/-wYxodgS8K10/UFi5xTVXRlI/AAAAAAAAA1Q/uvEFISZNvAE/s800/sergio04.png) transparent no-repeat right top; width:100%; min-height:322px">
  <h2>Enlaces relacionados</h2>
  {% include snip-links-relacionados.html tags='p:matar' %}
  </ul>
</div>
